const Common = require('./Common');

class User extends Common {
   
    lastnames = [
        "서준", "민준", "도윤", "시우", "예준", "하준", "지호", "주원", "지후", "도현",
        "준우", "준서", "건우", "우진", "현우", "선우", "지훈", "유준", "은우", "연우",
        "서진", "이준", "시윤", "민재", "현준", "정우", "윤우", "수호", "지우", "승우",
        "유찬", "지환", "이안", "승현", "준혁", "시후", "진우", "승민", "민성", "수현",
        "지원", "준영", "시현", "재윤", "은호", "우주", "지한", "태윤", "한결", "지안",
        "시온", "서우", "윤호", "시원", "은찬", "민우", "재원", "동현", "이현", "하진",
        "민규", "우빈", "민찬", "재민", "율", "로운", "하율", "도하", "지율", "준호",
        "윤재", "준", "태민", "성민", "재현", "지민", "하민", "민호", "승준", "현서",
        "성현", "예성", "하람", "태오", "지성", "태현", "이든", "규민", "태양", "민혁",
        "다온", "성준", "윤성", "정민", "도훈", "주안", "은성", "예찬", "지오", "주호",
        "준수", "준희", "도영", "건", "민석", "도율", "태준", "하랑", "강민", "지완",
        "시율", "준성", "승원", "도준", "승호", "정현", "현수", "성빈", "서율", "재하",
        "라온", "우현", "시훈", "시안", "단우", "시완", "민서", "윤", "주환", "건희",
        "도원", "원준", "하온", "민수", "정후", "도경", "서후", "정훈", "현", "온유",
        "유안", "연준", "동하", "정원", "승윤", "이한", "주영", "현민", "시환", "민건",
        "민기", "가온", "경민", "유건", "승빈", "현성", "재준", "세현", "호준", "태훈",
        "태율", "서호", "하늘", "태영", "재훈", "유현", "태경", "동건", "찬영", "범준",
        "산", "도겸", "현진", "하윤", "지혁", "선호", "세준", "성윤", "재영", "영준",
        "윤찬", "찬우", "현승", "주혁", "태호", "찬", "연호", "동윤", "서원", "재이",
        "지운", "시호", "우성", "승재", "상현", "건호", "윤후", "승훈", "도진", "태하",
        "찬희", "유진", "규빈", "로이", "성훈", "주한", "태이", "재희", "수민", "은율",
        "승찬", "태우", "수혁", "현호", "동욱", "재우", "우찬", "현빈", "주완", "시헌",
        "우준", "효준", "주현", "태인", "준후", "우영", "동우", "강현", "준석", "상윤",
        "성우", "재혁", "유빈", "형준", "유민", "하성", "강우", "도연", "지용", "윤서",
        "아준", "아인", "은준", "진호", "원우", "인우", "용준", "신우", "규현", "석현",
        "승후", "동준", "호진", "준형", "지웅", "상우", "서윤", "진혁", "승유", "해준",
        "재율", "동훈", "승환", "지온", "재호", "민결", "은혁", "이찬", "이도", "대현",
        "은수", "혜성", "세훈", "선율", "승주", "영민", "성원", "종현", "진서", "정빈",
        "여준", "유하", "유성", "준원", "윤건", "영우", "요한", "준현", "태환", "태건",
        "하루", "현석", "건후", "한율", "상민", "태성", "노아", "도건", "채민", "동혁",
        "시준", "서빈", "다원", "호연", "희찬", "한울", "우재", "동규", "유담", "성진",
        "우혁", "리안", "준범", "윤수", "서현", "건율", "주형", "희준", "찬민", "도운",
        "해솔", "정호", "은재", "찬율", "세윤", "로건", "가람", "서하", "원", "태원",
        "민제", "경준", "세진", "태웅", "환희", "결", "인성", "연후", "성호", "민승",
        "준민", "승혁", "상준", "승헌", "진영", "민", "재성", "정윤", "이수", "해성",
        "승기", "주성", "희성", "하빈", "성재", "윤준", "호영", "규원", "은후", "현규",
        "시영", "인호", "준하", "주하", "한별", "지윤", "지섭", "선재", "리우", "진욱",
        "강", "동연", "현욱", "세민", "다니엘", "정환", "시언", "우석", "찬혁", "창민",
        "진", "강준", "도형", "수빈", "이담", "로하", "준기", "한솔", "지석", "성찬",
        "예건", "한준", "민후", "영훈", "지수", "명준", "도헌", "태연", "기현", "주헌",
        "서안", "준휘", "상훈", "건하", "재형", "재인", "환", "시형", "민율", "재용",
        "주찬", "기범", "은결", "상원", "솔", "태규", "진성", "예담", "동민", "도빈",
        "호윤", "리한", "승연", "수환", "영재", "영진", "현재", "동원", "승범", "동호",
        "태희", "겸", "건영", "해인", "지헌", "찬유", "훈", "유신", "준모", "재범",
        "한빈", "유호", "석준", "민욱", "서한", "재환", "도균", "연수", "태빈", "연재",
        "수찬", "유겸", "준환", "한서", "찬빈", "재빈", "진원", "상혁", "영찬", "근우",
        "혁", "다율", "유승", "재욱", "성욱", "희재", "준상", "경훈", "의준", "채우",
        "동환", "리호", "동주", "대한", "찬호", "준이", "은규", "한", "제이", "윤혁",
        "형우", "선준", "지현", "시하", "종혁", "승규", "지유", "보겸", "도담"
    ];

    firstname = [
        "김", "이", "박", "최", "정",
        "강", "조", "윤", "장", "임",
        "한", "오", "서", "신", "권",
        "황", "안", "송", "전", "홍",
        "유", "고", "문", "양", "손",
        "배", "조", "백", "허", "유",
        "남", "심", "노", "정", "하",
        "곽", "성", "차", "주", "우",
        "구", "신", "임", "전", "민",
        "유", "류", "나", "진", "지",
        "엄", "채", "원", "천", "방",
        "공", "강", "현", "함", "변",
        "염", "양", "변", "여", "추",
        "노", "도", "소", "신", "석",
        "선", "설", "마", "길", "주",
        "연", "방", "위", "표", "명",
        "기", "반", "라", "왕", "금",
        "옥", "육", "인", "맹", "제",
        "모", "장", "남궁", "탁", "국",
        "여", "진", "어", "은", "편",
        "구", "용", "유", "예", "경",
        "봉", "정", "석", "사", "부",
        "황보", "가", "복", "태", "목",
        "진", "형", "계", "최", "피",
        "두", "지", "감", "장", "제갈",
        "음", "빈", "동", "온", "사공",
        "호", "경", "범", "전", "선우",
        "좌", "설", "팽", "승", "간",
        "하", "상", "시", "시", "갈",
        "서문", "진", "단", "호", "소",
        "견", "당"
    ];

    genFirstName() {
        let index = Math.floor(Math.random() * this.firstname.length);
        return this.firstname[index];
    }


    genLastName() {
        const index = Math.floor(Math.random() * this.lastnames.length);
        return this.lastnames[index];
    }

    genAge() {
        return Math.floor(Math.random() * 100) + 1;
    }

    genGender() {
        return Math.random() < 0.5 ? "남성" : "여성";
    }

    genBirthdate() {
        const year = Math.floor(Math.random() * 76) + 1950;  //0~99
        const month = Math.floor(Math.random() * 12) + 1;  //0~11
        let day = null;

        if (month % 2 === 1) {
            day = Math.floor(Math.random() * 31) + 1;
        }
        else if (month % 2 === 0) {

            if (month === 2) {

                if ((year % 4 == 0 && year % 100 != 0) || year % 400 == 0) {
                    day = Math.floor(Math.random() * 29) + 1;
                }
                else {
                    day = Math.floor(Math.random() * 28) + 1;
                }
            }
            else {
                day = Math.floor(Math.random() * 30) + 1;
            }
        }
        return `${year}-${String(month).padStart(2, '0')}-${String(day).padStart(2, '0')}`;
    }
}

module.exports = User;